/*
夏日 - 脚本调整 - 
脚本定制 仿制脚本 
唯一方式 79031334
*/

var text = "";
var status = 0;
var 等级 = [10,30,80, 100,120,140,160,180,200];
var 角色等级=1;

var 等级奖励 = [
    [0, 5000060, 1],//品克缤宠物
    [0, 1812000, 1],//宠物拾取金币
    [0, 1812001, 1],//宠物拾取道具
    [0, 1812002, 1],//自动HP
    [0, 1812003, 1],//自动MP
    //[0, 2028104, 1],//幸运神水
	//
    //[1, 1032234, 1],
    [1, 5000058, 1],//防具攻击
    //[1, 2049038, 2],//饰品攻击
    //[1, 2049041, 2],//饰品魔力
    //[1, 2028104, 2],//幸运神水

    [2, 1114313, 1],
    [2, 2049032, 4],//防具攻击
    //[2, 2049038, 4],//饰品攻击
    [2, 2049041, 4],//饰品魔力
    [2, 2028104, 4],//幸运神水

    [3, 1114314, 1],
    [3, 2049032, 6],//防具攻击
    //[3, 2049038, 6],//饰品攻击
    [3, 2049041, 6],//饰品魔力
    [3, 2028104, 6],//幸运神水

    [4, 1114315, 1],
    [4, 2049032, 8],//防具攻击
    //[4, 2049038, 8],//饰品攻击
    [4, 2049041, 8],//饰品魔力
    [4, 2028104, 8],//幸运神水

    [5, 1114316, 1],//
    //[5, 2049039, 10],//防具攻击
    //[5, 2049038, 10],//饰品攻击
    [5, 2049041, 10],//饰品魔力
    [5, 2028104, 10],//幸运神水

    [6, 1122267, 1],
    [6, 2049032, 12],//防具攻击
    //[6, 2049038, 12],//饰品攻击
    [6, 2049041, 12],//饰品魔力
    [6, 2028104, 12],//幸运神水

    [7, 1032223, 1],
    [7, 2049032, 14],//防具攻击
    //[7, 2049038, 14],//饰品攻击
    [7, 2049041, 14],//饰品魔力
    [7, 2028104, 14],//幸运神水
    
    [8, 1132246, 1],//1132246
    [8, 2049032, 16],//防具攻击
    //[8, 2049038, 16],//饰品攻击
    [8, 2049041, 16],//饰品魔力
    [8, 2028104, 16],//幸运神水



];
var 选择的等级;
function start() {
    status = -1;
    action(1, 0, 0);
}


function action(mode, type, selection) {
    if (mode == -1) {
        cm.dispose();
    } else {
        if (mode == 1) {
            status++;
        } else {
            status--;
        }
        //
        if (status == -1) {
            cm.dispose();
        } else if (status == 0) {
            角色等级 =cm.getLevel();
            text = "  #r#e◆角色等级奖励#n#k\r\n";
            text+="--------------------------------------------------------------------------------\r\n";
            text +="  ▲#k当前角色等级：[#b"+cm.getLevel()+"#k]\r\n"
            text += "  ▲角色等级每提升[#r20#k]都可以领取奖励\r\n";
            text += "  ▲#r每个账号仅限领取一次#k\r\n";
            text+="--------------------------------------------------------------------------------\r\n";
            if(角色等级 <10){
                cm.sendOk("30级以后再来吧!",2);
                cm.dispose();
                return;
            }
            for (var i = 0; i < 等级.length; i++) {
                if (角色等级 >= 等级[i]) {
					var strGetText = cm.getCharacterExtendValue("等级奖励");
                    text += "  #L" + i + "#★角色等级〈#r" + 等级[i] + "#k〉奖励[点击查看][" + (strGetText >= String(等级[i]) ? "#g已领取#k" : "#b未领取#k") + "]#l\r\n";
                }
            }
           // text += "\r\n ┗━━━━━━━━━━━━━━━━━━━━━━━━┛\r\n";
            cm.sendSimple(text,2);
        } else if (status == 1) {
            选择的等级 = selection;
            text = " #e◆角色等级[#b#e"+等级[选择的等级]+"#n#k#e]奖励#n#k\r\n\r\n";
            for (var i = 0; i < 等级奖励.length; i++) {
                if (等级奖励[i][0] == 选择的等级) {
                    if (等级奖励[i][1] != 2) {
                        text += "#r▲#k[#r#v" + 等级奖励[i][1] + "##z" + 等级奖励[i][1] + "##k] x "+等级奖励[i][2]+"\r\n";
                    } else {
                        text += "#r▲#k#k信用卡 x #r#e" + 等级奖励[i][2] + "#n#k\r\n";
                    }
                }

            }
            text += "\r\n#L0#点击领取角色等级[#r#e"+等级[选择的等级]+"#n#k]奖励#l\r\n";
            cm.sendSimple(text,2);
        } else if (status == 2) {
            if (cm.getPlayer().getLevel() < 等级[选择的等级]) {
                cm.sendOk("你的等级还不够[#r#e" + 等级[选择的等级] + "#n#k]级,无法领取奖励",2);
                cm.dispose();
                return;
            }
			var strGetText = cm.getCharacterExtendValue("等级奖励");
            if (strGetText >= String(等级[选择的等级]) ) {
                cm.sendOk("你当前账户已经领取过了角色奖励了.",2);
                cm.dispose();
                return;
            }
            if (cm.getInventory(1).isFull(0) || cm.getInventory(2).isFull(0) || cm.getInventory(3).isFull(0) || cm.getInventory(4).isFull(0) || cm.getInventory(5).isFull(0)) {
                cm.sendOk("请确定背包所有栏都有[1]个格子的空间",2);//
                cm.dispose();
                return;
            }//判断格子是否够
            cm.saveOrUpdateCharacterExtendValue("等级奖励",String(等级[选择的等级]));
            for (var i = 0; i < 等级奖励.length; i++) {
                if (等级奖励[i][0] == 选择的等级) {
                    if (等级奖励[i][1] != 2) {
                        cm.gainItem(等级奖励[i][1],等级奖励[i][2]);
                    } else {
                        cm.gainCash(4,等级奖励[i][2]);
                    }
                }
            }
            //
            cm.sendOk("[亲爱的,恭喜你成功领取角色等级奖励]",2);//
            cm.dispose();
            return;

        }
        //


    }
}